app/controllers/posts_controller.rb

  def create
    post.create(title: params[:post][:title], description: params[:post][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-08-11 14:46:57.380551"], ["updated_at", "2018-08-11 14:46:57.380551"]]